---
kind: property
id: P:Autodesk.Revit.DB.SweptBlend.BottomSketch
source: html/968170b5-f638-5149-0fb4-eb995ab8cfac.htm
---
# Autodesk.Revit.DB.SweptBlend.BottomSketch Property

The bottom profile sketch of the swept blend.

## Syntax (C#)
```csharp
public Sketch BottomSketch { get; }
```

## Remarks
If the bottom profile is based on a family symbol, this property is Nothing nullptr a null reference ( Nothing in Visual Basic) .